org/holymacs/consult.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Holymacs ~ Consult module</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../holymacs.html"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Holymacs ~ Consult module</h1>
<p>
Consult is an awesome set of functions. More info on <a href="https://github.com/minad/consult">github</a>.
</p>

<p>
It's a fancy set of features and gives Emacs a more cool and "modern" UX.
</p>

<p>
Also, I found an issue when generating an Embark snapshot from a standard Imenu completion: the results do not point to the location, but an error (<i>exit-minibuffer: No catch for tag: exit, nil</i>). I've tried <code>consult-imenu</code> and it seems working well with <b>embark</b> 🎉
</p>

<p>
Let's install it!
</p>

<p>
As mentioned in the <a href="org/holymacs.html#orgf3323eb"><b>Holymacs Specs</b></a> we're going to also add some super bindings.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">use-package</span> consult
  <span style="color: #3fb83f; font-weight: bold;">:bind</span>
  ((<span style="color: #af9fff;">"s-j"</span> . consult-buffer)
   (<span style="color: #af9fff;">"s-i"</span> . consult-outline)
   (<span style="color: #af9fff;">"s-l"</span> . consult-history)
   (<span style="color: #af9fff;">"s-I"</span> . consult-imenu-multi)
   (<span style="color: #af9fff;">"s-f"</span> . consult-line)
   (<span style="color: #af9fff;">"s-t"</span> . consult-grep)))
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-04-20 Sat 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.7.4)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
